from sqlalchemy.orm import Session
from app.database import SessionLocal

# файл может получить и "вадать" бэкенду соединение с БД с помощью
# объекта, прописанного в файле database.py
def get_db():
    db = SessionLocal()
    try: # если получилось получить соединение с БД без ошибок
        yield db # отдаем соединение без остановки функции
    # можно добавить блок или блоки except для обработки случаем с ошибкой
    finally: # не важно, получилось ли или нет подключиться к БД
        db.close() # в любом случае закрываем сессию с ней